In [1]:
import pandas as pd

In [3]:
objects=pd.Series(["Book","Paper","Pen"])

In [4]:
objects

0     Book
1    Paper
2      Pen
dtype: object

In [5]:
quantity=pd.Series(["1","5","2"])

In [6]:
quantity

0    1
1    5
2    2
dtype: object

In [7]:
dataframe=pd.DataFrame({"Goods":objects,"quantity":quantity})

In [8]:
dataframe

   Goods quantity
0   Book        1
1  Paper        5
2    Pen        2

In [9]:
carsales=pd.read_csv("car-sales.csv")

In [10]:
carsales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
carsales.head(5)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [22]:
carsales.to_csv("newcars.csv",index=False)

In [23]:
new=pd.read_csv("newcars.csv")

In [24]:
new

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00